{
  "items": {
    "Perban": {
      "desc": "Kain steril untuk menghentikan pendarahan ringan di dunia yang penuh luka.",
      "hp": 25,
      "energy": 0
    },
    "Herbal": {
      "desc": "Ramuan alami hasil racikan dari tumbuhan liar, menenangkan rasa sakit ringan.",
      "hp": 15,
      "energy": 5
    },
    "Painkiller": {
      "desc": "Obat pereda nyeri dosis tinggi. Mengembalikan HP namun menguras sedikit tenaga.",
      "hp": 35,
      "energy": -5
    },
    "Medkit": {
      "desc": "Kotak medis lengkap. Ditemukan di reruntuhan rumah sakit tua.",
      "hp": 50,
      "energy": 0
    },
    "Makanan": {
      "desc": "Bekal penting untuk bertahan hidup. Menambah sedikit HP dan memulihkan energi.",
      "hp": 10,
      "energy": 30
    },
    "Minuman": {
      "desc": "Air bersih dalam botol berdebu, sangat berharga di dunia yang kering.",
      "hp": 0,
      "energy": 20
    },
    "Kayu": {
      "desc": "Potongan kayu dari pohon lapuk, digunakan untuk membuat alat sederhana.",
      "hp": 0,
      "energy": 0
    },
    "Batu": {
      "desc": "Batu tajam, sering digunakan untuk membuat senjata darurat.",
      "hp": 0,
      "energy": 0
    },
    "Daun": {
      "desc": "Daun hijau yang masih tumbuh di tanah mati, bahan dasar ramuan herbal.",
      "hp": 0,
      "energy": 0
    }
  },

  "weapons": {
    "Tangan Kosong": {
      "desc": "Serangan dasar tanpa senjata. Hanya mengandalkan keberanian dan naluri bertahan hidup.",
      "atk": 5,
      "type": "melee"
    },
    "Pisau": {
      "desc": "Pisau tajam dan ringan, cocok untuk pertempuran jarak dekat.",
      "atk": 8,
      "type": "melee"
    },
    "Palu": {
      "desc": "Alat berat yang dijadikan senjata. Efektif menghancurkan tengkorak zombie.",
      "atk": 12,
      "type": "melee"
    },
    "Tombak": {
      "desc": "Senjata panjang buatan tangan, menjaga jarak dari gigitan mematikan.",
      "atk": 16,
      "type": "melee"
    },
    "Kampak": {
      "desc": "Kampak tajam yang dapat menebas kayu maupun kepala zombie.",
      "atk": 20,
      "type": "melee"
    },
    "Pedang": {
      "desc": "Senjata klasik dari zaman sebelum wabah, seimbang dalam serangan dan kecepatan.",
      "atk": 25,
      "type": "melee"
    },
    "Pistol": {
      "desc": "Senjata api ringan yang masih bisa ditemukan di pos polisi terbengkalai.",
      "atk": 35,
      "ammo": "Ammo 9mm",
      "type": "gun"
    },
    "Shotgun": {
      "desc": "Senjata jarak dekat dengan daya rusak tinggi, cocok untuk melawan gerombolan zombie.",
      "atk": 55,
      "ammo": "Ammo 12mm",
      "type": "gun"
    },
    "Sniper": {
      "desc": "Senjata jarak jauh peninggalan militer. Sekali tembak bisa menumbangkan satu zombie besar.",
      "atk": 95,
      "ammo": "Ammo 7.2mm",
      "type": "gun"
    },
    "Senapan Serbu": {
      "desc": "Senjata otomatis yang dulu digunakan tentara. Kini jadi alat bertahan hidup terakhir.",
      "atk": 60,
      "ammo": "Ammo 7.2mm",
      "type": "gun"
    }
  },

  "armors": {
    "Pakaian Lusuh": {
      "desc": "Pakaian tua dan kotor, hanya memberi sedikit perlindungan dari cakaran.",
      "def": 5
    },
    "Kaos": {
      "desc": "Baju tipis peninggalan dunia lama. Sedikit lebih baik dari pakaian lusuh.",
      "def": 8
    },
    "Kaos Panjang": {
      "desc": "Kaos berlengan panjang, sedikit melindungi dari goresan ringan.",
      "def": 10
    },
    "Sweater": {
      "desc": "Pakaian hangat dari masa lalu, menambah kenyamanan dan perlindungan.",
      "def": 14
    },
    "Jaket": {
      "desc": "Jaket kulit tua yang tebal, cukup tangguh menahan serangan zombie biasa.",
      "def": 20
    },
    "Rompi Lv1": {
      "desc": "Rompi buatan sendiri dengan bahan kulit tebal. Memberikan perlindungan dasar.",
      "def": 30
    },
    "Rompi Lv2": {
      "desc": "Rompi taktis lapisan baja ringan, sering digunakan oleh pemburu zombie.",
      "def": 40
    },
    "Rompi Lv3": {
      "desc": "Rompi militer asli, sulit ditemukan tapi hampir tidak bisa ditembus gigitan.",
      "def": 50
    }
  }
}
